{
  "Job_Title": "Software Engineer I",
  "Company_Name": "PDI Technologies",
  "Job_Location": "United States",
  "Job_Description": "Location: US Remote, Temple, TX preferredEmployee Level: Individual ContributorCareer Level: Mid-levelWhat You Need1 year of experience designing and developing new or maintaining existing software applications in a software product development environmentProficiency required in all of the following: .Net and C#Proficiency required in SQL performance troubleshooting and tuningFamiliarity with the Microsoft Visual Studio IDE and the use of Azure DevOps or Jira1+ years of practical experience with Agile development methodologiesHighly motivated self-starter with a desire to help others and take actionRequires strong written and verbal communication skills with the ability to translate technical concepts into non-technical termsAbility to independently work as a contributing member in a high-paced and focused teamAbility to multi-task and prioritize tasks with competing deadlinesStrong problem-solving and analytical skills with the ability to work under pressureAbility to socialize ideas and influence decisions without direct authorityCollaborative in nature with a strong desire to dig in and learn independently and as well as through asking questionsConsiders ‘best-practice’ standards, as well as departmental policies and proceduresComputer science fundamentals: OOP, design patterns, data structures & algorithmsThe Opportunity:We are looking to add a Software Engineer II and a Software Engineer III to our team. Do you love building software that thrills your customers? Do you insist on the highest standards for the software your team develops? Are you a progressive software engineer, an advocate of agile development practices, and a proponent of continuous improvement? If this is you, then join an energetic team of engineers building the next generation of solutions at PDI!What You’ll DoActively support and develop software solutions for PDI productsTroubleshoot and resolve software issues with due urgency and maintain thorough documentation of all software solutionsPerform engineering level tests to find defects; troubleshoot and debug production issuesGuides and trains less experienced engineersPartner with Product Management to consult on solution feasibility and high-level effort estimationPrepare and provide case status and risk assessments to their manager with appropriate levels of detail to ensure customer issues are properly escalated and prioritizedUse a disciplined approach in an Agile environment to assist in analysis and determination of preferred solutions to technical challengesWork with Product Owner to clarify and estimate feature work Why PDI Technologies? PDI Technologies, Inc. resides at the intersection of productivity and sales growth, delivering powerful solutions that serve as the backbone of the convenience retail and petroleum wholesale ecosystem. By “Connecting Convenience” across the globe, we empower businesses to increase productivity, make more informed decisions, and engage faster with their customers.We OfferComprehensive benefits package including health, dental, and vision coverage effective immediatelyFully flexible remote work environment Matching Group Retirement Savings PlanPTO effective immediately Quarterly self-investment allowance for personal and professional development, health and wellness, entertainment, travel, charitable giving, tech, travel, etc.Strong culture that values authenticity, trust, curiosity, and diversity of thoughtOur Commitment to Diversity, Inclusion & Belonging At PDI Technologies, diversity is embraced. We are committed to cultivating an environment that is safe, welcoming, and inclusive for all individuals. PDI Technologies is an Equal Opportunity Employer. We agree not to discriminate against any employee or job applicant because of race, color, religion, national origin, sex, physical or mental disability, or age.",
  "Post_Date": "2 weeks ago",
  "Num_Applicants": "Over 200 applicants",
  "Industry": "Software Development",
  "Application_Link": "https://www.linkedin.com/jobs/view/software-engineer-i-at-pdi-technologies-3955838229?position=7&pageNum=8&refId=%2Fu4Ny%2FHknfIdIBXnTTZ6HQ%3D%3D&trackingId=b%2FOJt7rlhpVHV5ES4qcYHg%3D%3D&trk=public_jobs_jserp-result_search-card"
}